#include <stdio.h>

int main(void)
{
	int a, b, c, d, e, f;

	printf("５０円　１０円　５円　１円\n");

	for (a = 0, b = 2, c = 0, d = 0, e = 0; b >= 0; b--) {//５０円玉の枚数を求める。

		for (c = (100 - 50 * b) / 10, d = 0, e = 0; c >= 0; c--) {//１０円玉の枚数を求める。

			for (d = (100 - (50 * b + 10 * c)) / 5, e = 0; d >= 0;a++ ,d--) {//５円玉の枚数を求める。

				e = 100 - (50 * b + 10 * c + d * 5);//１円玉の枚数を求める。

				f = 50 * b + 10 * c + 5 * d + e;//合計金額。

				if (f == 100) {
					printf("　%d 　　　%d 　　　%d 　　%d\n", b, c, d, e);//パターンを出力する。
				}
			}
		}
	}
	printf("%dパターン\n", a);//パターン数を出力する。
	return 0;
}
